{
  "001924": [
    {
      "author": "Makin",
      "content": "The ~ATH file on John's desktop actually has the same filename as Karkat's terrible attempt of a program, 2001 pages later."
    }
  ],
  "002238": [
    {
      "author": "Drew",
      "content": "The Ghostbusters theme was also among the easter egg tracks. Even back when MSPA was still a thing instead of homestuck.com, the secret songs were removed steadily over time. "
    }
  ],
  "002544": [
    {
      "author": "Makin",
      "content": "This flash originally used the song \"Skaian Dreams (Remix)\" by Bill Bolin. All Bolin contributions were removed from the comic, but if you want to listen to the old version tick the Enable Controversial Content setting in the collection."
    }
  ],
  "002551": [
    {
      "author": "Makin",
      "content": "This flash originally used the last part of the song \"Skaian Dreams (Remix)\" by Bill Bolin. All Bolin contributions were removed from the comic, but if you want to listen to the old version tick the Enable Controversial Content setting in the collection."
    }
  ],
  "002722": [
    {
      "author": "Makin",
      "content": "This flash originally used the song \"Guardian\" by Bill Bolin. All Bolin contributions were removed from the comic, but if you want to listen to the old version tick the Enable Controversial Content setting in the collection."
    }
  ],
  "002730": [
    {
      "author": "Makin",
      "content": "This flash originally used the songs \"Rediscover Fusion Remix\" and \"Kinetic Verdancy\" by Bill Bolin. All Bolin contributions were removed from the comic, but if you want to listen to the old version tick the Enable Controversial Content setting in the collection."
    }
  ],
  "002733": [
    {
      "author": "Makin",
      "content": "1031 is just a reference to the flash being posted right after Halloween (10/31 in the american date scheme). Also, did you ever notice the Felt's name tag is actually a pool table?"
    }
  ],
  "002743": [
    {
      "author": "Makin",
      "content": "The tire swing attack Hussie mentioned was based on Birdie's Murderer Chain attack from the Street Fighter Alpha series."
    }
  ],
  "002880": [
    {
      "author": "Makin",
      "content": "This flash originally used the song \"Mutiny\" by Bill Bolin. All Bolin contributions were removed from the comic, but if you want to listen to the old version tick the Enable Controversial Content setting in the collection."
    }
  ],
  "002922": [
    {
      "author": "Drew",
      "content": "Unfortunately, I think we have the answer to that question now."
    }
  ],
  "002926": [
    {
      "author": "Makin",
      "content": "This flash originally used the song \"Guardian V2\" by Bill Bolin. All Bolin contributions were removed from the comic, but if you want to listen to the old version tick the Enable Controversial Content setting in the collection."
    }
  ],
  "002970": [
    {
      "author": "Makin",
      "content": "This flash originally used the song \"Contention\" by Bill Bolin. All Bolin contributions were removed from the comic, but if you want to listen to the old version tick the Enable Controversial Content setting in the collection."
    }
  ],
  "003023": [
    {
      "author": "Drew",
      "content": "I don't know about pressing it with your finger, but touching it does just fine."
    }
  ],
  "003252": [
    {
      "author": "Makin",
      "content": "The donator that seeded the idea for the Midnight Crew actually created a non-canon leader for it, Professor Mayonaka, together with a non-canon fanventure about the Felt. This page used to feature Mayonaka's pendant on the floor, before Hussie covered it with ink later. More information is available here at Mayonaka's Ask Me Anything session https://www.reddit.com/r/homestuck/comments/9ilope/i_am_mayonaka_with_proof_ama/"
    }
  ],
  "003314": [
    {
      "author": "Serenity",
      "content": "Yay!!!"
    }
  ],
  "003523": [
    {
      "author": "Drew",
      "content": "For those who may not remember, Hussie is referring to the \"Trickster Mario\" conversation with Caliborn on page 5781."
    }
  ],
  "003549": [
    {
      "author": "Drew",
      "content": "Whoops."
    }
  ],
  "003620": [
    {
      "author": "Makin",
      "content": "This flash originally used the songs \"Beatdown (Shitstorm Remix)\", \"Browbeat\", \"Beatdown (Trance Praxis)\", \"Strider Showdown\", \"Beatdown (Remix v3)\" and \"Unbound\" by Bill Bolin. All Bolin contributions were removed from the comic, but if you want to listen to the old version tick the Enable Controversial Content setting in the collection."
    }
  ],
  "003743": [
    {
      "author": "Drew",
      "content": "After all these years the mystery has been solved."
    }
  ],
  "004097": [
    {
      "content": "In the book, the command \"Vriska: Proceed to computer.\" is accidentally written down as \"Vriska: Begin Meddling.\", a command that actually gets used a bit later."
    }
  ],
  "005614": [
    {
      "author": "Makin",
      "content": "That's it for the commentary mod of the Homestuck Collection! As of 2022, it doesn't seem like Viz is ever going to release more Homestuck books. According to ex-employees, there was a plan to have further commentary written by Aysha U. Farah or another of What Pumpkin's writers, to complete the running joke of the 'therapist' helping Andrew Hussie. I, for one, am glad we'll never get it."
    }
  ],
  "000310": [
    {
      "author": "Drew Linky",
      "content": "If you count the flashing \"CUT SCENE\" image at the top, this is technically the first animated page in all of MSPA."
    }
  ],
  "000336": [
    {
      "author": "Drew Linky",
      "content": "I know it's nitpicking considering I already pointed out the \"CUT SCENE\" on page 92, but this is the first so-called \"actually animated\" page on the website with stuff being visibly altered onscreen somehow."
    }
  ],
  "001214": [
    {
      "author": "Bambosh",
      "content": "These two pages are absent from the book, for some reason."
    }
  ],
  "001722": [
    {
      "author": "Makin",
      "content": "And here it is: https://www.instagram.com/p/BgJqofOHoV1/?taken-by=teacupscosplay"
    }
  ]
}